# .zsh_plugins.txt - antidote plugin declarations

# Oh-My-Zsh compatibility layer (must be first)
getantidote/use-omz

# OMZ core library (keybindings, history defaults, colorization)
ohmyzsh/ohmyzsh path:lib

# OMZ plugins
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/wd

# Third-party plugins
zap-zsh/supercharge
zap-zsh/exa

# Prompt theme (must load synchronously for instant prompt)
romkatv/powerlevel10k

# Deferred plugins — loaded after prompt renders for faster startup
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-syntax-highlighting kind:defer
