cask_args appdir: '/Applications'
tap 'caskroom/cask'

cask '1password'
# cask 'atom'
cask 'bettertouchtool'
cask 'betterzipql'
cask 'cyberduck'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'macdown'
cask 'mactex'
cask 'plex-media-server'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'skitch'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'vlc'

# cask 'sonarr'
# cask 'virtualbox'

brew 'awscli'
brew 'ansible'
brew 'bash'
brew 'ctags'
brew 'cscope'
brew 'direnv'
brew 'gettext'
# link 'gettext', args: ['--force']
brew 'fswatch'
brew 'fzf'
brew 'git'
brew 'go', args: ['cross-compile-common']
brew 'imagemagick'
brew 'jq'
brew 'neovim'
brew 'qemu'
brew 'postgresql', restart_service: :changed
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'redis', restart_service: :changed
brew 'rbenv'
brew 'ruby-build'
brew 'the_silver_searcher'
brew 'tmux'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

tap 'homebrew/dupes'
brew 'bzip2'
brew 'grep'
brew 'ncurses'
brew 'readline'
brew 'rsync'
brew 'unzip'
brew 'whois'
brew 'xz'
brew 'zlib'

tap 'homebrew/versions'
brew 'qt55'
