cask_args appdir: '/Applications'
tap 'homebrew/cask-versions'

cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'authy'
cask 'bettertouchtool'
# cask 'cyberduck'
cask 'docker'
# cask 'dropbox'
# cask 'evernote'
cask 'gpg-suite' # used to sign git commits, see https://docs.github.com/en/authentication/managing-commit-signature-verification/signing-commits
# cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'grammarly'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'loom'
# cask 'macdown'
# cask 'mactex'
cask 'notion'
cask 'postman'
cask 'postgres-unofficial'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'skitch'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'visual-studio-code'
# cask 'vlc'
cask 'zoom'
