cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'

cask '1password6'
cask 'authy'
cask 'bettertouchtool'
cask 'cyberduck'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
# cask 'google-backup-and-sync'
# cask 'google-chrome'
cask 'iterm2'
# cask 'macdown'
# cask 'mactex'
# cask 'plex-media-server'
cask 'postman'
# cask 'private-internet-access'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'skitch'
cask 'slack'
# cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
# cask 'transmission'
cask 'visual-studio-code'
# cask 'vlc'

# cask 'sonarr'
# cask 'virtualbox'

brew 'awscli'
# brew 'ansible'
# brew 'bash'
brew 'bat'
brew 'ctags'
brew 'cscope'
brew 'direnv'
brew 'gettext'
# link 'gettext', args: ['--force']
brew 'fd'
brew 'fswatch'
brew 'fzf'
brew 'git'
brew 'go'
brew 'imagemagick'
brew 'jq'
brew 'kubectl'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'kube-ps1'
brew 'mas'
brew 'neovim'
brew 'qemu'
# brew 'postgresql', restart_service: :changed
# brew 'postgis'
brew 'pyenv'
brew 'pyenv-virtualenv'
# brew 'recode'
brew 'redis', restart_service: :changed
brew 'rbenv'
brew 'ripgrep'
brew 'ruby-build'
brew 'sbt'
brew 'stern'
brew 'tealdeer'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

tap 'homebrew/dupes'
brew 'bzip2'
brew 'grep'
brew 'ncurses'
brew 'readline'
brew 'rsync'
brew 'unzip'
brew 'whois'
brew 'xz'
brew 'zlib'

# Mac Apple Store
mas "todoist", id: 585829637
