# Development Tools
brew 'act'                      # Run GitHub Actions locally - https://github.com/nektos/act
brew 'gh'                       # GitHub CLI - https://github.com/cli/cli
brew 'git'                      # Version control system
brew 'git-delta'                # Better git diff viewer - https://github.com/dandavison/delta
brew 'git-recent'               # View recent git branches - https://github.com/paulirish/git-recent
brew 'lazygit'                  # Terminal UI for git - https://github.com/jesseduffield/lazygit
brew 'git-filter-repo'          # Rewrite git history safely - https://github.com/newren/git-filter-repo
brew 'git-lfs'                  # Git Large File Storage - https://github.com/git-lfs/git-lfs
brew 'tig'                      # Text-mode interface for git - https://github.com/jonas/tig

# Programming Languages & Runtimes
brew 'mise'                     # Polyglot version manager - https://github.com/jdx/mise
brew 'uv'                       # Fast Python package manager - https://github.com/astral-sh/uv
brew 'go'                       # Go programming language
brew 'rust'                     # Rust programming language

# Shell & Terminal Tools
brew 'antidote'                 # Zsh plugin manager - https://github.com/mattmc3/antidote
brew 'atuin'                    # Shell history sync & search - https://github.com/atuinsh/atuin
brew 'bat'                      # Cat clone with syntax highlighting - https://github.com/sharkdp/bat
brew 'btop'                     # Resource monitor - https://github.com/aristocratos/btop
brew 'eza'                      # Modern ls replacement - https://github.com/eza-community/eza
brew 'fzf'                      # Fuzzy finder - https://github.com/junegunn/fzf
brew 'mosh'                     # Mobile shell (SSH alternative) - https://github.com/mobile-shell/mosh
brew 'sesh'                     # Smart session manager for tmux - https://github.com/joshmedeski/sesh
brew 'tmux'                     # Terminal multiplexer - https://github.com/tmux/tmux
brew 'zoxide'                   # Smarter cd command - https://github.com/ajeetdsouza/zoxide
brew 'zsh-completions'          # Additional zsh completions - https://github.com/zsh-users/zsh-completions

# Text Editors
# neovim installed via GitHub nightly (see setup-vim)
brew 'lua-language-server'      # LSP for Lua/Neovim config - https://github.com/LuaLS/lua-language-server

# Media
brew 'ffmpeg'                   # Audio/video converter - https://ffmpeg.org

# Search & File Tools
brew 'fd'                       # Fast find alternative - https://github.com/sharkdp/fd
brew 'fswatch'                  # File change monitor - https://github.com/emcrisostomo/fswatch
brew 'ripgrep'                  # Fast grep alternative - https://github.com/BurntSushi/ripgrep
brew 'tree'                     # Directory tree viewer

# Data Processing
brew 'jq'                       # JSON processor - https://github.com/jqlang/jq
brew 'miller'                   # CSV/JSON/etc processor - https://github.com/johnkerl/miller
brew 'xsv'                      # CSV toolkit - https://github.com/BurntSushi/xsv
brew 'yq'                       # YAML processor - https://github.com/mikefarah/yq

# Cloud & Infrastructure
brew 'awscli'                   # AWS command line interface
brew 'gcalcli'                  # Google Calendar CLI - https://github.com/insanum/gcalcli
brew 'pulumi'                   # Infrastructure as code - https://github.com/pulumi/pulumi

# Containers & VMs
brew 'docker-compose'           # Multi-container Docker apps - https://github.com/docker/compose


# Databases
brew 'postgresql@18'            # PostgreSQL database
brew 'redis', restart_service: :changed  # In-memory data store

# Build & Task Tools
brew 'just'                     # Command runner - https://github.com/casey/just

# Testing & Performance
brew 'k6'                       # Load testing tool - https://github.com/grafana/k6

# Network Tools
brew 'socat'                    # Socket relay utility
brew 'wget'                     # File downloader
brew 'whois'                    # Domain lookup tool

# Documentation & Conversion
brew 'tealdeer'                 # Fast tldr client - https://github.com/dbrgn/tealdeer

# Backup Tools
brew 'restic'                   # Fast, secure backup program - https://github.com/restic/restic

# Utilities
brew 'gnupg'                    # GPG encryption & signing - used by mise, git commit signing
brew 'ctags'                    # Code indexing tool
brew 'cscope'                   # Code browsing tool
brew 'diff-so-fancy'            # Better diff output - https://github.com/so-fancy/diff-so-fancy
brew 'dos2unix'                 # Convert line endings
brew 'gettext'                  # Internationalization library
brew 'mas'                      # Mac App Store CLI - https://github.com/mas-cli/mas

# System Libraries (for building from source)
brew 'bzip2'
brew 'grep'
brew 'ncurses'
brew 'readline'
brew 'rsync'
brew 'p7zip'                    # 7-Zip file archiver - https://github.com/p7zip-project/p7zip
brew 'unzip'
brew 'xz'
brew 'zlib'

# Fonts (fonts are now in main homebrew/cask, no tap needed)
cask 'font-3270-nerd-font'      # Nerd Fonts: https://www.nerdfonts.com/font-downloads
cask 'font-meslo-for-powerlevel10k'  # Powerlevel10k recommended font
