cask_args appdir: '/Applications'

# Taps
tap 'supabase/tap'
tap 'withgraphite/tap'

# Password Managers
cask '1password'                # Password manager - https://1password.com
cask '1password-cli'            # 1Password CLI for scripting & SSH agent - https://developer.1password.com/docs/cli

# Productivity
cask 'alt-tab'                  # Windows-style alt-tab window switcher - https://alt-tab-macos.netlify.app
# cask 'alfred'                   # Spotlight replacement & automation - https://www.alfredapp.com
# cask 'bettertouchtool'        # Advanced input customization - https://folivora.ai - replaced with Raycast Window Management
cask 'cleanshot'                # Screen capturing tool - https://getcleanshot.com
cask 'linear-linear'            # Project management & issue tracking - https://linear.app
cask 'loom'                     # Screen recording & sharing - https://www.loom.com
cask 'notion'                   # Notes & collaboration - https://www.notion.so
cask 'notion-calendar'          # Calendar for professionals - https://www.notion.com/product/calendar
cask 'obsidian'                 # Knowledge base with Markdown - https://obsidian.md
cask 'raycast'                  # Launcher & productivity tool - https://raycast.com
cask 'wispr-flow'               # Voice-to-text dictation - https://wisprflow.ai

# Development Tools
cask 'bruno'                    # Opensource API client - https://github.com/usebruno/bruno
cask 'chatgpt'                  # OpenAI's official ChatGPT desktop app - https://chatgpt.com
cask 'claude'                   # Anthropic's official Claude AI desktop app - https://claude.ai
cask 'cursor'                   # AI-powered code editor - https://www.cursor.com
cask 'docker-desktop'           # Docker for Mac - https://www.docker.com/products/docker-desktop
cask 'ghostty'                  # Fast, native terminal emulator - https://github.com/ghostty-org/ghostty
cask 'lm-studio'                # Run local LLMs - https://lmstudio.ai
cask 'termius'                  # SSH client - https://termius.com
cask 'visual-studio-code'       # Code editor - https://github.com/microsoft/vscode
# cask 'sublime-text'             # Text editor - https://www.sublimetext.com
cask 'zed'                      # Multiplayer code editor - https://zed.dev

cask 'codex'                    # OpenAI Codex CLI - https://github.com/openai/codex

tap 'manaflow-ai/cmux'
cask 'cmux'                     # AI-powered terminal multiplexer - https://github.com/manaflow-ai/cmux

# Cloud & Infrastructure
cask 'gcloud-cli'               # Google Cloud SDK - https://cloud.google.com/sdk
cask 'ngrok'                    # Secure tunneling - https://ngrok.com

# Communication
cask 'slack'                    # Team chat - https://slack.com
cask 'superhuman'               # Email client - https://superhuman.com
cask 'telegram'                 # Messaging - https://telegram.org
cask 'whatsapp'                 # Messaging - https://www.whatsapp.com
cask 'zoom'                     # Video conferencing - https://zoom.us

# Security & Privacy
cask 'gpg-suite'                # GPG tools for macOS - used to sign git commits
                                # https://docs.github.com/en/authentication/managing-commit-signature-verification/signing-commits
cask 'tailscale'                # VPN & secure networks - https://tailscale.com
cask 'tailscale-app'            # Tailscale standalone app (non-App Store) - https://tailscale.com

# Storage & Sync
cask 'dropbox'                  # File sync & storage - https://www.dropbox.com
cask 'google-drive'             # Google Drive sync - https://www.google.com/drive/

# Browsers
cask 'google-chrome'            # Web browser
cask 'helium-browser'           # Floating browser window - https://helium.computer/
cask 'vivaldi'                  # Feature-rich web browser - https://vivaldi.com
# cask 'firefox'

# Productivity (additional)
cask 'ticktick'                 # Task manager - https://ticktick.com

# Entertainment
cask 'spotify'                  # Music streaming - https://www.spotify.com
